app/controllers/comments_controller.rb

  def index
    @query_string = request.query_parameters['post']
    @comments = Comment.where(post: @query_string)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post" = ?  [["post", "1D5opuQCGF3flqVaXkvJF1"]]

  def create
    @comment = Comment.new(comment_params)

    if @comment.save
---
INSERT INTO "comments" ("message", "name", "email", "post", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def set_comment
      @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ?  [["id", nil]]