app/controllers/posts_controller.rb

    def show_region
        @posts = Post.where( region: params[:region] )
---
SELECT "posts".* FROM "posts" WHERE "posts"."region" = ?  [["region", "region"]]

    def show_post

      #decode the URI if needed
      @title = HTMLEntities.new.decode params[:title]

      puts @title

      @post = Post.find_by title: @title
      @prevPost = Post.find_by id: @post.id - 1
      @nextPost = Post.find_by id: @post.id + 1
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]