app/controllers/posts_controller.rb

    def show
      @posts = Post.where({ region: params[:region] })
---
SELECT "posts".* FROM "posts" WHERE "posts"."region" = ?  [["region", "region"]]