app/controllers/subscribers_controller.rb

INSERT INTO "subscribers" ("countries", "created_at", "updated_at", "address") VALUES (?, ?, ?, ?)  [["countries", "[]"], ["created_at", "2020-03-23 00:03:37.768757"], ["updated_at", "2020-03-23 00:03:37.768757"], ["address", "email@email.com"]]
---
    def subscribe

      Subscriber.create(:address => params[:address], :countries => params[:countries])