app/models/post.rb

     def self.upsert_database

        # delete all Posts currently in the table
        Post.where(:featured => true).update_all(:featured => false)

        # create all news articles from API by countries
        regions = ['ca','us','de','it','gb','fr','nl','at','ch']

        for region in regions do

             # create featured news articles
            url = 'http://newsapi.org/v2/top-headlines?'\
            'q=Corona&'\
            'q=Corona Virus&'\
            'country=%s&'\
            'q=COVID&'\
            'q=COVID-19&'\
            'q=covid-19&'\
            'sortBy=popularity&' \
            'apiKey=764acb82041f45f7a8bc847b05da23cc' % region
            req = open(url)
            res = JSON.parse(req.read)

            # map article to table format and upsert
            for post in res['articles'] do

                Post.find_or_create_by(
                    :title => post['title'],
                    :author => post['author'],
                    :body => post['content'],
                    :date => post['publishedAt'],
                    :headerImg => post['urlToImage'],
                    :url => post['url'],
                    :region => region,
                    :featured => false
                )
---
UPDATE "posts" SET "featured" = 0 WHERE "posts"."featured" = ?  [["featured", 1]]
INSERT INTO "posts" ("author", "body", "date", "headerImg", "title", "created_at", "updated_at", "url", "featured", "region") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "posts".* FROM "posts" WHERE "posts"."title" = ? AND "posts"."author" IS NULL AND "posts"."body" IS NULL AND "posts"."date" = ? AND "posts"."headerImg" IS NULL AND "posts"."url" = ? AND "posts"."region" = ? AND "posts"."featured" = ? LIMIT ?

        end

        # create featured posts based on date
        Post.where({ date: (Time.now.midnight - 1.day)..Time.now.midnight }).update_all(:featured => true)
---
UPDATE "posts" SET "featured" = 1 WHERE "posts"."date" BETWEEN ? AND ?  [["date", "2020-03-21 04:00:00"], ["date", "2020-03-22 04:00:00"]]