app/models/subscriber.rb

SELECT "posts".* FROM "posts" WHERE "posts"."date" BETWEEN ? AND ? AND NOT (("posts"."headerImg" = ? OR "posts"."headerImg" IS NULL))  [["date", "2020-03-21 04:00:00"], ["date", "2020-03-22 04:00:00"], ["headerImg", ""]]
---
    def self.mail_subscribers

        # if date - date.now < 24 hrs, mail out post data
        @all_posts = Post.where({ date: (Time.now.midnight - 1.day)..Time.now.midnight }).where.not(headerImg: [nil, ""])

        @formatted_all_posts = @all_posts.map do |post|

SELECT "posts".* FROM "posts" WHERE "posts"."region" = ? AND "posts"."date" BETWEEN ? AND ? AND NOT (("posts"."headerImg" = ? OR "posts"."headerImg" IS NULL))  [["region", "ca"], ["date", "2020-03-21 04:00:00"], ["date", "2020-03-22 04:00:00"], ["headerImg", ""]]
SELECT "posts".* FROM "posts" WHERE "posts"."region" = ? AND "posts"."date" BETWEEN ? AND ?  [["region", "ca"], ["date", "2020-03-21 04:00:00"], ["date", "2020-03-22 04:00:00"]]
---
        for @region in regions do

            # if date - date.now < 24 hrs and :region = region, mail out post data, with a header img
            @posts = Post.where({ region: @region, date: (Time.now.midnight - 1.day)..Time.now.midnight }).where.not(headerImg: [nil, ""])

            @formatted_posts = @posts.map do |post|