app/models/subscriber.rb

SELECT "posts".* FROM "posts" WHERE "posts"."region" = ? AND "posts"."date" BETWEEN ? AND ?  [["region", "ca"], ["date", "2020-03-21 04:00:00"], ["date", "2020-03-22 04:00:00"]]
---
    def self.mail_subscribers

        regions = ['ca']

        regions_map = {
            'ca' => 'Canada'
        }

        for @region in regions do

            # if date - date.now < 24 hrs and :region = region, mail out post data, with a header img
            @posts = Post.where({ region: @region, date: (Time.now.midnight - 1.day)..Time.now.midnight }).where.not(headerImg: [nil, ""])

            @formatted_posts = @posts.map do |post|